9/data/attachments/1ead4c54cf774f82.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_034437aa-e179-48af-b527-98e33272c2ae</nif:username>
            <nif:friendToBeAdded>Robin_perhaps_Actions_60792_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>